ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_ccu8_map.h
#if (UC_DEVICE == XMC1302) && (UC_PACKAGE == TSSOP16)
#define CCU80_IN0_BCCU0_OUT0               	8
#define CCU80_IN0_BCCU0_OUT1               	9
#define CCU80_IN0_CCU40_GP2                	2
#define CCU80_IN0_CCU40_SR2                	10
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU81_GP0                	12
#define CCU80_IN0_ERU0_IOUT0               	6
#define CCU80_IN0_ERU0_PDOUT0              	5
#define CCU80_IN0_ERU0_PDOUT1              	11
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN1_BCCU0_OUT2               	8
#define CCU80_IN1_BCCU0_OUT3               	9
#define CCU80_IN1_CCU40_SR2                	10
#define CCU80_IN1_CCU41_GP2                	2
#define CCU80_IN1_CCU80_ST0                	13
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU82_GP0                	12
#define CCU80_IN1_ERU0_IOUT1               	6
#define CCU80_IN1_ERU0_PDOUT0              	11
#define CCU80_IN1_ERU0_PDOUT1              	5
#define CCU80_IN1_P0_5                     	1
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN2_BCCU0_OUT4               	8
#define CCU80_IN2_BCCU0_OUT5               	9
#define CCU80_IN2_CCU40_SR3                	10
#define CCU80_IN2_CCU42_GP2                	2
#define CCU80_IN2_CCU80_ST0                	13
#define CCU80_IN2_CCU80_ST1                	14
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU83_GP0                	12
#define CCU80_IN2_ERU0_IOUT2               	6
#define CCU80_IN2_ERU0_PDOUT0              	11
#define CCU80_IN2_ERU0_PDOUT2              	5
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN3_BCCU0_OUT6               	8
#define CCU80_IN3_BCCU0_OUT7               	9
#define CCU80_IN3_CCU40_SR3                	10
#define CCU80_IN3_CCU43_GP2                	2
#define CCU80_IN3_CCU80_GP0                	12
#define CCU80_IN3_CCU80_ST0                	13
#define CCU80_IN3_CCU80_ST1                	14
#define CCU80_IN3_CCU80_ST2                	15
#define CCU80_IN3_ERU0_IOUT3               	6
#define CCU80_IN3_ERU0_PDOUT0              	11
#define CCU80_IN3_ERU0_PDOUT3              	5
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_GSC80                	7
#endif


#if (UC_DEVICE == XMC1302) && (UC_PACKAGE == TSSOP28)
#define CCU80_IN0_BCCU0_OUT0               	8
#define CCU80_IN0_BCCU0_OUT1               	9
#define CCU80_IN0_CCU40_GP2                	2
#define CCU80_IN0_CCU40_SR2                	10
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU81_GP0                	12
#define CCU80_IN0_ERU0_IOUT0               	6
#define CCU80_IN0_ERU0_PDOUT0              	5
#define CCU80_IN0_ERU0_PDOUT1              	11
#define CCU80_IN0_P0_12                    	0
#define CCU80_IN0_P0_4                     	1
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN1_BCCU0_OUT2               	8
#define CCU80_IN1_BCCU0_OUT3               	9
#define CCU80_IN1_CCU40_SR2                	10
#define CCU80_IN1_CCU41_GP2                	2
#define CCU80_IN1_CCU80_ST0                	13
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU82_GP0                	12
#define CCU80_IN1_ERU0_IOUT1               	6
#define CCU80_IN1_ERU0_PDOUT0              	11
#define CCU80_IN1_ERU0_PDOUT1              	5
#define CCU80_IN1_P0_12                    	0
#define CCU80_IN1_P0_5                     	1
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN2_BCCU0_OUT4               	8
#define CCU80_IN2_BCCU0_OUT5               	9
#define CCU80_IN2_CCU40_SR3                	10
#define CCU80_IN2_CCU42_GP2                	2
#define CCU80_IN2_CCU80_ST0                	13
#define CCU80_IN2_CCU80_ST1                	14
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU83_GP0                	12
#define CCU80_IN2_ERU0_IOUT2               	6
#define CCU80_IN2_ERU0_PDOUT0              	11
#define CCU80_IN2_ERU0_PDOUT2              	5
#define CCU80_IN2_P0_10                    	1
#define CCU80_IN2_P0_12                    	0
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN3_BCCU0_OUT6               	8
#define CCU80_IN3_BCCU0_OUT7               	9
#define CCU80_IN3_CCU40_SR3                	10
#define CCU80_IN3_CCU43_GP2                	2
#define CCU80_IN3_CCU80_GP0                	12
#define CCU80_IN3_CCU80_ST0                	13
#define CCU80_IN3_CCU80_ST1                	14
#define CCU80_IN3_CCU80_ST2                	15
#define CCU80_IN3_ERU0_IOUT3               	6
#define CCU80_IN3_ERU0_PDOUT0              	11
#define CCU80_IN3_ERU0_PDOUT3              	5
#define CCU80_IN3_P0_12                    	0
#define CCU80_IN3_P0_13                    	1
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_GSC80                	7
#endif


#if (UC_DEVICE == XMC1302) && (UC_PACKAGE == TSSOP38)
#define CCU80_IN0_BCCU0_OUT0               	8
#define CCU80_IN0_BCCU0_OUT1               	9
#define CCU80_IN0_CCU40_GP2                	2
#define CCU80_IN0_CCU40_SR2                	10
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU81_GP0                	12
#define CCU80_IN0_ERU0_IOUT0               	6
#define CCU80_IN0_ERU0_PDOUT0              	5
#define CCU80_IN0_ERU0_PDOUT1              	11
#define CCU80_IN0_P0_12                    	0
#define CCU80_IN0_P0_4                     	1
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN1_BCCU0_OUT2               	8
#define CCU80_IN1_BCCU0_OUT3               	9
#define CCU80_IN1_CCU40_SR2                	10
#define CCU80_IN1_CCU41_GP2                	2
#define CCU80_IN1_CCU80_ST0                	13
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU82_GP0                	12
#define CCU80_IN1_ERU0_IOUT1               	6
#define CCU80_IN1_ERU0_PDOUT0              	11
#define CCU80_IN1_ERU0_PDOUT1              	5
#define CCU80_IN1_P0_12                    	0
#define CCU80_IN1_P0_5                     	1
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN2_BCCU0_OUT4               	8
#define CCU80_IN2_BCCU0_OUT5               	9
#define CCU80_IN2_CCU40_SR3                	10
#define CCU80_IN2_CCU42_GP2                	2
#define CCU80_IN2_CCU80_ST0                	13
#define CCU80_IN2_CCU80_ST1                	14
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU83_GP0                	12
#define CCU80_IN2_ERU0_IOUT2               	6
#define CCU80_IN2_ERU0_PDOUT0              	11
#define CCU80_IN2_ERU0_PDOUT2              	5
#define CCU80_IN2_P0_10                    	1
#define CCU80_IN2_P0_12                    	0
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN3_BCCU0_OUT6               	8
#define CCU80_IN3_BCCU0_OUT7               	9
#define CCU80_IN3_CCU40_SR3                	10
#define CCU80_IN3_CCU43_GP2                	2
#define CCU80_IN3_CCU80_GP0                	12
#define CCU80_IN3_CCU80_ST0                	13
#define CCU80_IN3_CCU80_ST1                	14
#define CCU80_IN3_CCU80_ST2                	15
#define CCU80_IN3_ERU0_IOUT3               	6
#define CCU80_IN3_ERU0_PDOUT0              	11
#define CCU80_IN3_ERU0_PDOUT3              	5
#define CCU80_IN3_P0_12                    	0
#define CCU80_IN3_P0_13                    	1
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_GSC80                	7
#endif


