ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_ccu8_map.h
#if (UC_DEVICE == XMC1404) && (UC_PACKAGE == LQFP64)
#define CCU80_IN0_BCCU0_OUT0               	8
#define CCU80_IN0_BCCU0_OUT1               	9
#define CCU80_IN0_BCCU0_OUT2               	16
#define CCU80_IN0_CCU40_GP2                	2
#define CCU80_IN0_CCU40_SR2                	10
#define CCU80_IN0_CCU80_ST0                	19
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU80_ST3B               	24
#define CCU80_IN0_CCU81_GP0                	12
#define CCU80_IN0_ERU0_IOUT0               	6
#define CCU80_IN0_ERU0_PDOUT0              	5
#define CCU80_IN0_ERU0_PDOUT1              	11
#define CCU80_IN0_ERU1_IOUT0               	22
#define CCU80_IN0_ERU1_PDOUT0              	21
#define CCU80_IN0_ERU1_PDOUT1              	23
#define CCU80_IN0_P0_12                    	0
#define CCU80_IN0_P0_4                     	1
#define CCU80_IN0_P4_0                     	20
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_ACMP1_OUT            	17
#define CCU80_IN0_SCU_ACMP2_OUT            	18
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN1_BCCU0_OUT2               	8
#define CCU80_IN1_BCCU0_OUT3               	9
#define CCU80_IN1_BCCU0_OUT7               	16
#define CCU80_IN1_CCU40_SR2                	10
#define CCU80_IN1_CCU41_GP2                	2
#define CCU80_IN1_CCU80_ST0B               	24
#define CCU80_IN1_CCU80_ST1                	19
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU82_GP0                	12
#define CCU80_IN1_ERU0_IOUT1               	6
#define CCU80_IN1_ERU0_PDOUT0              	11
#define CCU80_IN1_ERU0_PDOUT1              	5
#define CCU80_IN1_ERU1_IOUT1               	22
#define CCU80_IN1_ERU1_PDOUT0              	23
#define CCU80_IN1_ERU1_PDOUT1              	21
#define CCU80_IN1_P0_12                    	0
#define CCU80_IN1_P0_5                     	1
#define CCU80_IN1_P4_1                     	20
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_ACMP1_OUT            	18
#define CCU80_IN1_SCU_ACMP2_OUT            	17
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN2_BCCU0_OUT1               	16
#define CCU80_IN2_BCCU0_OUT4               	8
#define CCU80_IN2_BCCU0_OUT5               	9
#define CCU80_IN2_CCU40_SR3                	10
#define CCU80_IN2_CCU42_GP2                	2
#define CCU80_IN2_CCU80_ST0                	13
#define CCU80_IN2_CCU80_ST1B               	24
#define CCU80_IN2_CCU80_ST2                	19
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU83_GP0                	12
#define CCU80_IN2_ERU0_IOUT2               	6
#define CCU80_IN2_ERU0_PDOUT0              	11
#define CCU80_IN2_ERU0_PDOUT2              	5
#define CCU80_IN2_ERU1_IOUT2               	22
#define CCU80_IN2_ERU1_PDOUT0              	23
#define CCU80_IN2_ERU1_PDOUT2              	21
#define CCU80_IN2_P0_10                    	1
#define CCU80_IN2_P0_12                    	0
#define CCU80_IN2_P4_2                     	20
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_ACMP0_OUT            	17
#define CCU80_IN2_SCU_ACMP3_OUT            	18
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN3_BCCU0_OUT6               	8
#define CCU80_IN3_BCCU0_OUT7               	9
#define CCU80_IN3_BCCU0_OUT8               	16
#define CCU80_IN3_CCU40_SR3                	10
#define CCU80_IN3_CCU43_GP2                	2
#define CCU80_IN3_CCU80_GP0                	12
#define CCU80_IN3_CCU80_ST0                	13
#define CCU80_IN3_CCU80_ST1                	14
#define CCU80_IN3_CCU80_ST2                	15
#define CCU80_IN3_CCU80_ST2B               	24
#define CCU80_IN3_CCU80_ST3                	19
#define CCU80_IN3_ERU0_IOUT3               	6
#define CCU80_IN3_ERU0_PDOUT0              	11
#define CCU80_IN3_ERU0_PDOUT3              	5
#define CCU80_IN3_ERU1_IOUT3               	22
#define CCU80_IN3_ERU1_PDOUT0              	23
#define CCU80_IN3_ERU1_PDOUT3              	21
#define CCU80_IN3_P0_12                    	0
#define CCU80_IN3_P0_13                    	1
#define CCU80_IN3_P4_3                     	20
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_ACMP0_OUT            	18
#define CCU80_IN3_SCU_ACMP3_OUT            	17
#define CCU80_IN3_SCU_GSC80                	7
#define CCU81_IN0_BCCU0_OUT0               	8
#define CCU81_IN0_BCCU0_OUT6               	9
#define CCU81_IN0_CCU40_GP2                	2
#define CCU81_IN0_CCU41_SR2                	10
#define CCU81_IN0_CCU81_GP0                	12
#define CCU81_IN0_CCU81_SR0                	16
#define CCU81_IN0_CCU81_ST0                	19
#define CCU81_IN0_CCU81_ST1                	13
#define CCU81_IN0_CCU81_ST2                	14
#define CCU81_IN0_CCU81_ST3                	15
#define CCU81_IN0_CCU81_ST3B               	24
#define CCU81_IN0_ERU0_IOUT0               	6
#define CCU81_IN0_ERU0_PDOUT0              	5
#define CCU81_IN0_ERU0_PDOUT1              	11
#define CCU81_IN0_ERU1_IOUT0               	22
#define CCU81_IN0_ERU1_PDOUT0              	21
#define CCU81_IN0_ERU1_PDOUT1              	23
#define CCU81_IN0_P0_12                    	20
#define CCU81_IN0_P3_0                     	0
#define CCU81_IN0_P4_6                     	1
#define CCU81_IN0_POSIF1_OUT2              	3
#define CCU81_IN0_POSIF1_OUT5              	4
#define CCU81_IN0_SCU_ACMP0_OUT            	18
#define CCU81_IN0_SCU_ACMP1_OUT            	17
#define CCU81_IN0_SCU_GSC80                	7
#define CCU81_IN1_BCCU0_OUT4               	8
#define CCU81_IN1_BCCU0_OUT7               	9
#define CCU81_IN1_CCU41_GP2                	2
#define CCU81_IN1_CCU41_SR2                	10
#define CCU81_IN1_CCU81_SR1                	16
#define CCU81_IN1_CCU81_ST0                	13
#define CCU81_IN1_CCU81_ST0B               	24
#define CCU81_IN1_CCU81_ST1                	19
#define CCU81_IN1_CCU81_ST2                	14
#define CCU81_IN1_CCU81_ST3                	15
#define CCU81_IN1_CCU82_GP0                	12
#define CCU81_IN1_ERU0_IOUT1               	6
#define CCU81_IN1_ERU0_PDOUT0              	11
#define CCU81_IN1_ERU0_PDOUT1              	5
#define CCU81_IN1_ERU1_IOUT1               	22
#define CCU81_IN1_ERU1_PDOUT0              	23
#define CCU81_IN1_ERU1_PDOUT1              	21
#define CCU81_IN1_P0_13                    	20
#define CCU81_IN1_P3_0                     	0
#define CCU81_IN1_P4_2                     	1
#define CCU81_IN1_POSIF1_OUT2              	3
#define CCU81_IN1_POSIF1_OUT5              	4
#define CCU81_IN1_SCU_ACMP1_OUT            	18
#define CCU81_IN1_SCU_ACMP2_OUT            	17
#define CCU81_IN1_SCU_GSC80                	7
#define CCU81_IN2_BCCU0_OUT1               	9
#define CCU81_IN2_BCCU0_OUT5               	8
#define CCU81_IN2_CCU41_SR3                	10
#define CCU81_IN2_CCU42_GP2                	2
#define CCU81_IN2_CCU81_SR2                	16
#define CCU81_IN2_CCU81_ST0                	13
#define CCU81_IN2_CCU81_ST1                	14
#define CCU81_IN2_CCU81_ST1B               	24
#define CCU81_IN2_CCU81_ST2                	19
#define CCU81_IN2_CCU81_ST3                	15
#define CCU81_IN2_CCU83_GP0                	12
#define CCU81_IN2_ERU0_IOUT2               	6
#define CCU81_IN2_ERU0_PDOUT0              	11
#define CCU81_IN2_ERU0_PDOUT2              	5
#define CCU81_IN2_ERU1_IOUT2               	22
#define CCU81_IN2_ERU1_PDOUT0              	23
#define CCU81_IN2_ERU1_PDOUT2              	21
#define CCU81_IN2_P0_10                    	1
#define CCU81_IN2_P0_14                    	20
#define CCU81_IN2_P3_0                     	0
#define CCU81_IN2_POSIF1_OUT2              	3
#define CCU81_IN2_POSIF1_OUT5              	4
#define CCU81_IN2_SCU_ACMP0_OUT            	17
#define CCU81_IN2_SCU_ACMP3_OUT            	18
#define CCU81_IN2_SCU_GSC80                	7
#define CCU81_IN3_BCCU0_OUT2               	9
#define CCU81_IN3_BCCU0_OUT8               	8
#define CCU81_IN3_CCU41_SR3                	10
#define CCU81_IN3_CCU43_GP2                	2
#define CCU81_IN3_CCU80_GP0                	12
#define CCU81_IN3_CCU81_SR3                	16
#define CCU81_IN3_CCU81_ST0                	13
#define CCU81_IN3_CCU81_ST1                	14
#define CCU81_IN3_CCU81_ST2                	15
#define CCU81_IN3_CCU81_ST2B               	24
#define CCU81_IN3_CCU81_ST3                	19
#define CCU81_IN3_ERU0_IOUT3               	6
#define CCU81_IN3_ERU0_PDOUT0              	11
#define CCU81_IN3_ERU0_PDOUT3              	5
#define CCU81_IN3_ERU1_IOUT3               	22
#define CCU81_IN3_ERU1_PDOUT0              	23
#define CCU81_IN3_ERU1_PDOUT3              	21
#define CCU81_IN3_P0_15                    	20
#define CCU81_IN3_P3_0                     	0
#define CCU81_IN3_P4_10                    	1
#define CCU81_IN3_POSIF1_OUT2              	3
#define CCU81_IN3_POSIF1_OUT5              	4
#define CCU81_IN3_SCU_ACMP2_OUT            	18
#define CCU81_IN3_SCU_ACMP3_OUT            	17
#define CCU81_IN3_SCU_GSC80                	7
#endif


